In [1]:
import numpy as np
import pandas as pd

Pandas- Series

In [2]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {1:10,2:20,3:30}

In [3]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(arr,index= labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(d)

1    10
2    20
3    30
dtype: int64

Dataframe''

In [7]:
data1 = {
    "Name":['John','Anna','Peter','Linda'],
    "Age":[28,34,29,42],
    "City":['New York', 'Paris', 'Berlin', 'London'],
    "Salary":[65000,70000,62000,85000]
}
df = pd.DataFrame(data1)
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [8]:
Data2 = [
    ['john',28,'New York', 65000],
    ['Anna',34, 'Paris',70000 ],
    ['Peter',29,'Paris',62000],
    ['Linda',42,'London',85000]
]

columns = ['Name','Age','City','Salary']
df2 = pd.DataFrame(Data2, columns = columns)
df2

    Name  Age      City  Salary
0   john   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29     Paris   62000
3  Linda   42    London   85000

In [9]:
df2['City']

0    New York
1       Paris
2       Paris
3      London
Name: City, dtype: object

In [10]:
df2[['Name','City']]

    Name      City
0   john  New York
1   Anna     Paris
2  Peter     Paris
3  Linda    London

Creating a Column

In [11]:
df2["Designation"] =['Doctor','Enginner','Coder','Teacher']

In [12]:
df2

    Name  Age      City  Salary Designation
0   john   28  New York   65000      Doctor
1   Anna   34     Paris   70000    Enginner
2  Peter   29     Paris   62000       Coder
3  Linda   42    London   85000     Teacher

In [13]:
df2.drop("Designation",axis=1,inplace= False)
df2.drop("Designation",axis=1,inplace= True)

In [14]:
df2

    Name  Age      City  Salary
0   john   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29     Paris   62000
3  Linda   42    London   85000

In [15]:
df2.loc[[0,1]]

   Name  Age      City  Salary
0  john   28  New York   65000
1  Anna   34     Paris   70000

In [16]:
df2

    Name  Age      City  Salary
0   john   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29     Paris   62000
3  Linda   42    London   85000

In [17]:
df2.loc[[0,1]][["City","Salary"]]

       City  Salary
0  New York   65000
1     Paris   70000

In [18]:
df2.loc[[2,3]][["Name","Age"]]

    Name  Age
2  Peter   29
3  Linda   42

Condition Statement/Selection

In [19]:
# Only Age > 30
df2[df2["Age"]>30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [20]:
# only Age > 30 , City = Paris
df2[(df2["Age"] > 30) & (df["City"] == 'Paris')]

   Name  Age   City  Salary
1  Anna   34  Paris   70000